app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC LIMIT 25 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "posts" LIMIT 10 OFFSET 10) subquery_for_count
---
	def index
	@posts = Post.order(created_at: :desc).page(params[:page])